РП/src/Catalogs/СоответствияСчетовМеждународногоУчета/СоответствияСчетовМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствияСчетовМеждународногоУчета</name>
  <attributes>
    <name>СчетРеглУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияСубконто</name>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьИзРеглУчета</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УказанноеЗначение</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Выражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/СоответствияСчетовМеждународногоУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает схему компоновки данных для настройки соответствия счетов
//
// Параметры
// 	СчетРеглУчета - ПланСчетовСсылка.Хозрасчетный - Счет регл. учета
//
// ВозвращаемоеЗначение:
// 	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, применяемая для настройки соответствия счетов
//
Функция СхемыКомпоновкиДанных(СчетРеглУчета) Экспорт
	
	СхемаКомпоновкиДанных = Справочники.СоответствияСчетовМеждународногоУчета.ПолучитьМакет("СхемаКомпоновкиДанных");
	ПоляНабора = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	
	РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетРеглУчета, "Код, Наименование");
	
	ВидыСубконто = ФинансоваяОтчетностьПовтИсп.ВидыСубконтоСчета(СчетРеглУчета);
	Для НомерСубконто = 1 По 3 Цикл
		ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Субконто%1", НомерСубконто);
		Поле = ПоляНабора.Найти(ПутьКДанным);
		СтрокаВидСубконто = ВидыСубконто.Найти(НомерСубконто, "НомерСубконто");
		Если СтрокаВидСубконто <> Неопределено Тогда
			Поле.Заголовок = Строка(СтрокаВидСубконто.ВидСубконто);
			Поле.ТипЗначения = СтрокаВидСубконто.ТипЗначения;
		Иначе
			Поле.ОграничениеИспользования.Условие = Истина;
			Поле.ОграничениеИспользованияРеквизитов.Условие = Истина;
			Поле.ОграничениеИспользования.Поле = Истина;
			Поле.ОграничениеИспользованияРеквизитов.Поле = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
